Revit 2026 API

# PartUtilsIsPartDerivedFromLink Method

---

Is the Part derived from link geometry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsPartDerivedFromLink(
	Part dPart
)
```
```vb
Public Shared Function IsPartDerivedFromLink (
	dPart As Part
) As Boolean
```
```cpp
public:
static bool IsPartDerivedFromLink(
	Part^ dPart
)
```
```fsharp
static member IsPartDerivedFromLink :
        dPart : Part -> bool
```

#### Parameters

dPart Part

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace